const Description = () => {
  return (
    <div className="px-4 pb-6 flex-1 overflow-auto">
      <p className="text-black font-semibold text-xs leading-3.5 text-justify">
        Роман Михаила Афанасьевича Булгакова, работа над которым началась, по
        одним данным, в 1928 году, по другим - в 1929-м. Работа над «Мастером и
        Маргаритой» продолжалась вплоть до смерти писателя в марте 1940 года.
        Роман относится к незавершённым произведениям; редактирование и сведение
        воедино черновых записей осуществляла после смерти мужа вдова писателя -
        Елена Сергеевна. Первоначальная версия произведения, задуманного как
        «роман о дьяволе», имела рабочее название «Копыто инженера» и была
        уничтожена Булгаковым в 1930 году. В последующих редакциях среди героев
        произведения появились автор романа о Понтии Пилате и его возлюбленная.
        Окончательное название - «Мастер и Маргарита» - закрепилось в 1937 году.
      </p>
    </div>
  );
};

export default Description;
